# RemoveWireMaterialType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..RemoveWireMaterialType Method
ElectricalSetting Class See Also
---
Remove the wire material type from project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void RemoveWireMaterialType(
	WireMaterialType materialType
)
```

Visual Basic
---
```text
Public Sub RemoveWireMaterialType ( _
	materialType As WireMaterialType _
)
```

Visual C++
---
```text
public:
void RemoveWireMaterialType(
	WireMaterialType^ materialType
)
```

# ### Parameters
materialType
    Type: Autodesk.Revit.DB.Electrical..::..WireMaterialTypeThe wire material type to be removed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Wire material type can be removed only if it is not currently assigned to any wire type, and the last one wire material type can't be removed, otherwise an exception will be thrown. |

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace